package idea.scr.familyTree;

import java.util.List;

/**
 *      Объектно-ориентированное программирование
 */
//todo: Урок 1. Принципы ООП: Инкапсуляция, наследование, полиморфизм

public class FamilyTree {
    public static void main(String[] args) {
    /**
     *  Реализовать, с учетом ооп подхода, приложение.
     *  Для проведения исследований с генеалогическим древом.
     *  Идея: описать некоторое количество компонент, например: модель человека и дерева
     *  Под “проведением исследования” можно понимать например получение всех детей выбранного человека.
     */

    //todo: ООП => инкапсуляция, наследование полиморфизм

        Human human1 = new Human ("жен","Иванова",
                "Елена", "Вячеславовна","14.10.1987",36,"-");

        System.out.println(human1);
        List<Human> humanList;

        // Добавление человека
//        public void addHuman {
//
//        }
    }
}
